app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "lala"], ["body", "lalala laqlalalal"], ["created_at", "2018-01-12 13:29:49.715799"], ["updated_at", "2018-01-12 13:29:49.715799"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_blog

      @blog = Blog.friendly.find(params[:id])